Revit 2024 API
BuiltInFailures.MEPSupportFailures.InstanceOutOfHostError Property
 The instance of [Symbol] lost its host and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InstanceOutOfHostError { get; }
Visual Basic
Public Shared ReadOnly Property InstanceOutOfHostError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InstanceOutOfHostError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPSupportFailures Class
Autodesk.Revit.DB Namespace